//状态错误码
export const HTTP_STATUS_CODE = {
    '400': '错误请求',
    '401': '未授权，请重新登录',
    '403': '禁止访问',
    '404': '请求错误,未找到该资源',
    '405': '请求方法未允许',
    '408': '请求超时',
    '500': '服务器端出错',
    '501': '网络未实现',
    '502': '网络错误',
    '503': '服务不可用',
    '504': '网络超时',
    '505': 'http版本不支持该请求',
    default: '连接到服务器失败'
};
// 返回错误码
export const HTTP_RESPONSE_ERROR = {
    '10015': '操作失败，请重新尝试',
    '10022': '签名错误',
    '20001': '缺少参数',
    '20002': '签名appkey与secret不匹配',
    '20003': '签名错误',
    '20004': '用户不存在',
    '20005': '项目类型错误',
    '20006': '项目创建数超过每日限制',
    '20007': '项目标题为空',
    '20008': '项目不存在',
    '20009': '用户和项目创建者不匹配',
    '20010': '题目不存在',
    '20011': '参数值异常',
    '20012': '选项图片上传错误',
    '20013': '编辑锁定中',
    '20014': '文件不存在',
    '20015': '手机号未绑定',
    '20016': '访问终端不支持',
    '20017': '答卷已领取过红包',
    '20018': '红包应用不可用',
    '20019': '红包领取校验码错误',
    '20020': '获取用户信息失败',
    '20021': '信息发送太频繁',
    '20022': '手机号或验证码为空',
    '20023': '验证码错误',
    '20024': '手机号不匹配',
    '20025': '用户名为空',
    '20026': '密码为空',
    '20027': '用户名和密码不匹配',
    '20028': '手机号为空',
    '20029': '手机号已被占用',
    '20030': '发送验证码失败',
    '20031': '账号被冻结',
    '20032': 'qq授权失败',
    '20033': '手机号匹配正则未通过',
    '20034': '题目不存在',
    '20035': '没有复活卡可减',
    '20040': '红包不存在',
    '20041': '红包审核未通过',
    '20042': '红包领取微信token错误',
    '20043': '红包领取未知异常',
    '20044': '已经答过该题',
    '20045': '小程序获取用户信息失败',
    '20046': '订单不存在',
    '20047': '订单已支付',
    '20048': '红包消费记录创建失败',
    '20049': '应用不存在',
    '20050': '下载报表失败',
    '20051': '余额不足',
    '20052': 'unionid不存在',
    '20053': '小程序授权失败',
    '30001': '绑定手机号等检查到已有绑定需要合并账号',
    '30002': '项目包含敏感词',
    '30004': '项目最低得分不能低于-1000',
    '30005': '项目总分不能超过1000',
    '30006': '随机抽题禁止删除',
    '30007': '打乱顺序禁止删除',
    '30070': '按题型随机抽题禁止删除',
    '50002': '未知错误'
};

export const REDIRECT_LOGIN_ERROR = {
    '10001': '未登录',
    '40403': '未登录',
    '40502': '无权限访问'
};

export const PAGE_ERROR = {
    '10002': 'un-auth',
    // '10003': 'un-auth',
    '10004': 'not-found'
};

// 客户端error
export const HTTP_CLIENT_ERROR = {
    ECONNABORTED: '请求超时，请检查网络后重试'
};

export const LOGIN_ERROR = {
    10001: '认证失败',
    10002: '发送太频繁',
    10003: '发送验证码失败',
    10006: '信息发送太频繁'
};
