基本数据类型：Srting  Number  Boolean  Null Undefined  Symbol
引用数据类型：
    Object
    Function：一种特别的对象
    Array: 一种特别的对象(有数值下标，内部数据是有序)

判断数据类型方法：
第一种：typeof
    可判断： undefined / number / string / boolean / function
    不可判断：null / object / array

第二种：instanceof
    判断对象的具体类型

第三种：===
    可判断：undefined / null


1. undefined 与 null的区别？
    undefined代表定义未赋值，而null表示定义并赋值了，只是值为null，null是个对象

2. 什么时候给变量赋值为null呢？
    * 初始赋值，表明将要赋值为对象
    * 结束前，让对象成为垃圾对象(被垃圾回收器回收)

3. 严格区分变量类型和数据类型？
    * 数据的类型
        * 基本类型
        * 引用类型
    * 变量的类型(变量内存值的类型)
        * 基本类型：保存的是基本类型的数据
        * 引用类型：保存的是地址值


问题1：在js调用函数时传递变量参数时，是按值传递还是引用传递？
    * 只有按值传递，没有引用传递，传递的都是变量的值，只是这个值可能是基本类型数据，也有可能是引用类型(地址)数据
    * 如果后一种看成是引用类型数据传递，那就是按值传递和引用传递都可以有

问题2：js引擎如何管理内存？
    1. 内存生命周期
      * 分配所需的内存
      * 使用分配到的内存
      * 不需要时将其释放/归还
    2. 释放内存
      * 为执行函数分配的栈空间内存：函数执行完后自动释放
      * 存储对象的堆空间内存：当内存没有引用指向时，对象成为垃圾对象，浏览器垃圾回收器就会收回此对象释放内存
